USE movie_rec;

INSERT INTO `movie` (`douban_id`, `title`, `director`, `actors`, `genre`, `release_date`, `runtime`, `summary`, `poster_url`, `douban_rating`, `avg_rating`, `rating_count`) VALUES
('1292052', '肖申克的救赎', '弗兰克·德拉邦特', '蒂姆·罗宾斯,摩根·弗里曼,鲍勃·冈顿', '犯罪,剧情', '1994-09-10', 142, '一场谋杀案使银行家安迪蒙冤入狱，谋杀妻子及其情人的指控将囚禁他终生。在肖申克监狱的终身监禁注定让安迪的余生只能在阴暗中度过，但安迪在监狱中结识了诸多狱友，其中瑞德和安迪尤为投缘，安迪的不懈努力给狱友们带来了久违的自由感觉。', 'https://img2.doubanio.com/view/photo/s_ratio_poster/public/p480747492.jpg', 9.7, 9.7, 0),
('1291546', '霸王别姬', '陈凯歌', '张国荣,张丰毅,巩俐', '剧情,爱情', '1993-01-01', 171, '段小楼与程蝶衣是一对打小一起长大的师兄弟，两人一个演生一个演旦，一向配合天衣无缝。尤其一出《霸王别姬》誉满京城。但两人对戏剧与人生关系的理解有本质不同，段小楼深知戏非人生，程蝶衣则是人戏不分。', 'https://img2.doubanio.com/view/photo/s_ratio_poster/public/p2561716440.jpg', 9.6, 9.6, 0),
('1292720', '阿甘正传', '罗伯特·泽米吉斯', '汤姆·汉克斯,罗宾·怀特,加里·西尼斯', '剧情,爱情', '1994-06-23', 142, '阿甘于二战结束后不久出生在美国南方阿拉巴马州一个闭塞的小镇，他先天弱智，智商只有75。然而他的妈妈是一个性格坚强的女性，她常常鼓励阿甘，要他自强不息。', 'https://img2.doubanio.com/view/photo/s_ratio_poster/public/p2372307693.jpg', 9.5, 9.5, 0),
('1295644', '泰坦尼克号', '詹姆斯·卡梅隆', '莱昂纳多·迪卡普里奥,凯特·温斯莱特,比利·赞恩', '剧情,爱情,灾难', '1997-12-19', 194, '1912年4月10日，号称"世界工业史上的奇迹"的豪华客轮泰坦尼克号开始了自己的处女航，从英国的南安普顿出发驶往美国纽约。富家少女罗丝与母亲及未婚夫卡尔一道上船，另一边，不羁的少年画家杰克靠在码头上的一场赌博赢到了船票。', 'https://img2.doubanio.com/view/photo/s_ratio_poster/public/p457760035.jpg', 9.5, 9.5, 0),
('1292063', '美丽人生', '罗伯托·贝尼尼', '罗伯托·贝尼尼,尼可莱塔·布拉斯基,乔治·坎塔里尼', '剧情,喜剧,爱情', '1997-12-20', 116, '犹太青年圭多邂逅美丽的女教师多拉，他彬彬有礼的向多拉鞠躬："早安！公主！"。历经诸多令人啼笑皆非的周折后，天遂人愿，两人幸福美满的生活在一起。然而好景不长，法西斯政权下，圭多和儿子被强行送往犹太人集中营。', 'https://img2.doubanio.com/view/photo/s_ratio_poster/public/p2578474613.jpg', 9.5, 9.5, 0);
